help/Duffing.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title><b>Duffing</b> - Duffing Oscillator</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-05-10 17:21:48 CEST"/>
<meta name="author" content="Oswald Berthold"/>
</head><body>
<h1 class="title"><b>Duffing</b> - Duffing Oscillator</h1>

<p>see also: WeaklyNonlinear(2), from SLUGens/sc3-plugins
</p>

<ul>
<li>
<b>drv</b>: driving signal
</li>
<li>
<b>freq</b>: iteration frequency in hertz
</li>
<li>
<b>alpha</b>: linear damping
</li>
<li>
<b>beta</b>: nonlinear damping
</li>
<li>
<b>gamma</b>: input coupling
</li>
<li>
<b>delta</b>: parameter
</li>
<li>
<b>xi</b>: initial x value (x0)
</li>
<li>
<b>yi</b>: initial y value (y0)
</li>
<li>
<b>mul</b>: as usual
</li>
<li>
<b>add</b>: s.a.

</li>
</ul>

<p>implements a Duffing Oscillator, see
<a href="http://en.wikipedia.org/wiki/Duffing_equation">http://en.wikipedia.org/wiki/Duffing_equation</a> using Lance Putnam's
Runge-Kutta version.
</p>



<pre class="example">
Duffing.equation
</pre>





<pre class="example">
{Duffing.ar(drv: SinOsc.ar(100), freq: 22050, alpha: 0.6, beta: 0.1, gamma: 0.01, delta: 0.023, h: 0.05, xi: 0.1, yi: 0.1)}.play
</pre>





<pre class="example">
// explore parameter space
(
{Out.ar(0, Pan2.ar(
        1.0 * Duffing.ar(drv: SinOsc.ar(1.3e2), freq: s.sampleRate,
                alpha: MouseX.kr(0, 5.0), beta: 0.1, gamma: MouseY.kr(0, 1.0), delta: 0.023,
                h: 0.05, xi: 0.1, yi: 0.1, mul: 0.05)
))}.play
)
</pre>





<pre class="example">
(
{Out.ar(0, Pan2.ar(
        0.5*Duffing.ar(drv: SinOsc.ar(40), freq: s.sampleRate,
                alpha: MouseX.kr(0.001, 5.0), beta: MouseX.kr(0.001, 5.0),
                gamma: MouseY.kr(0, 1.0), delta: MouseY.kr(-1.0, -0.001, 1),
                h: 0.05, xi: 0.1, yi: 0.1, mul: 0.05)
))}.play
)
</pre>





<pre class="example">
// ...
(
SynthDef(\duff, {|freq(22050), mfreq(1), alpha(0.1), beta(0.1), gamma(0.0), delta(0.025),
        x0(0.1), y0(0.1), amp(0.1)|
        //      SinOsc.ar(mfreq)
        var duf = Duffing.ar(drv: Impulse.ar(mfreq), freq: freq,
                alpha: alpha, beta: beta, gamma: gamma, delta: delta,
                h: 0.05, xi: x0, yi: y0, mul: amp);
        Out.ar(0, duf);
}).store;
)

(
x = Synth(\duff, [\freq, s.sampleRate/2, \amp, 0.6, \alpha, 2.6, \beta, 1500.5, \delta, 0.01,
        \x0, 0.0, \y0, 1.0, \gamma, 0.0, \mfreq, 1
]);
)
x.free;

(
x = Synth(\duftest, [\amp, 0.6, \alpha, 2.6, \beta, 156.5, \delta, 0.07,
        \x0, 0.0, \y0, 1.0, \gamma, 0.0, \mfreq, 1
]);
)
x.free;

(// explore parameter space
x = Synth(\duftest, [\amp, 0.2, \alpha, 2.6, \beta, 10, \delta, 0.03,
        \x0, 0.0, \y0, 1.0, \gamma, 0.1, \mfreq, 1, \freq, s.sampleRate/2
]);

t = Task {
        var dur = 3.0;
        var pa, pb, pc, pd;
        pb = Pseq([Pstutter(9, Pseq([10.0, 8.0, 5.0, 0.0], inf))], 1).asStream;
        pc = Pseq([0.1, 0.15, 0.2], inf).asStream;
        pd = Pseq([Pstutter(3, Pseq([0.03, 0.02, 0.035], inf))], 1).asStream;
        inf.do {
                x.set(\beta, pc.next.postln);
                x.set(\gamma, pc.next.postln);
                x.set(\delta, pd.next.postln);
                dur.wait;
        };
};
{t.start}.defer(1);
)

// and so forth ...
</pre>



<div id="postamble"><p class="author"> Author: Oswald Berthold
<a href="mailto:opt@xdv.org">&lt;opt@xdv.org&gt;</a>
</p>
<p class="date"> Date: 2009-05-10 17:21:48 CEST</p>
<p>HTML generated by org-mode 6.21b in emacs 22</p>
</div></body>
</html>
